## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.ecs_events will be created
  + resource "aws_cloudwatch_event_rule" "ecs_events" {
      + arn            = (known after apply)
      + description    = "Capture ECS events from the metrics cluster"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail = {
                  + clusterArn = [
                      + "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics",
                    ]
                }
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "metrics-production-ecs-events"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.ecs_events will be created
  + resource "aws_cloudwatch_event_target" "ecs_events" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "metrics-production-ecs-events"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.ecs_events will be created
  + resource "aws_cloudwatch_log_group" "ecs_events" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/ecs_events"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.ecs_warn_error_event will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_warn_error_event" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ecs_events"
      + name           = "EcsWarnErrorEvent"
      + pattern        = "?Warn ?Error"

      + metric_transformation {
          + default_value = "0"
          + name          = "EcsWarnErrorEvent"
          + namespace     = "CovidShieldMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.ecs_warn_error_event will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_warn_error_event" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:820252213580:alert-warning",
        ]
      + alarm_description                     = "Metrics ECS warning or error event detected"
      + alarm_name                            = "MetricEcsWarnErrorEvent"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsWarnErrorEvent"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_role.ecs_events_lambda will be created
  + resource "aws_iam_role" "ecs_events_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsEventsLambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_events_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_events_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "EcsEventsLambda"
    }

  # aws_lambda_function.ecs_events will be created
  + resource "aws_lambda_function" "ecs_events" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to write ECS events to a CloudWatch log group."
      + filename                       = "/tmp/ecs_events.py.zip"
      + function_name                  = "ecs_events"
      + handler                        = "ecs_events.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "t1GAz6jHVchz0hIz/Fn+Co6VAweAG790rRR8EoA3gNU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                       = {
          + "CostCentre" = "CovidShield"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.ecs_events will be created
  + resource "aws_lambda_permission" "ecs_events" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>